In [2]:
import pandas as pd
import numpy as np
import os
import glob
import sqlite3

In [9]:
df = pd.read_excel('esercizio1.xlsx')
df

       Nome  Cognome  Età
0    Pietro   Rossi    22
1     Mario    Verdi   12
2  Giuseppe      Blu   44
3   Franco   Bianchi   45
4     Marco    Viola   88
5   Filippo     Fini   17

In [12]:
df['Età'].apply(lambda x: x * 2)

0     44
1     24
2     88
3     90
4    176
5     34
Name: Età, dtype: int64

In [13]:
df

       Nome  Cognome  Età
0    Pietro   Rossi    22
1     Mario    Verdi   12
2  Giuseppe      Blu   44
3   Franco   Bianchi   45
4     Marco    Viola   88
5   Filippo     Fini   17

In [14]:
df['Maggiorenne']=df['Età'].apply(lambda x: 'yes' if x>=18 else 'no')

In [15]:
df

       Nome  Cognome  Età Maggiorenne
0    Pietro   Rossi    22         yes
1     Mario    Verdi   12          no
2  Giuseppe      Blu   44         yes
3   Franco   Bianchi   45         yes
4     Marco    Viola   88         yes
5   Filippo     Fini   17          no

In [16]:
df['doubleEta']=df['Età'].apply(lambda x: x*2)

In [17]:
df

       Nome  Cognome  Età Maggiorenne  doubleEta
0    Pietro   Rossi    22         yes         44
1     Mario    Verdi   12          no         24
2  Giuseppe      Blu   44         yes         88
3   Franco   Bianchi   45         yes         90
4     Marco    Viola   88         yes        176
5   Filippo     Fini   17          no         34

In [24]:
df['TripleEta']=df.apply(lambda x: x[2]+x[4], axis=1)

In [29]:
df

       Nome  Cognome  Età Maggiorenne  doubleEta  TripleEta
0    Pietro   Rossi    22         yes         44         66
1     Mario    Verdi   12          no         24         36
2  Giuseppe      Blu   44         yes         88        132
3   Franco   Bianchi   45         yes         90        135
4     Marco    Viola   88         yes        176        264
5   Filippo     Fini   17          no         34         51

In [30]:
df.to_excel('esercizio2.xlsx', index=False)